Brother-JOE/STM32_MedicineDeliveryCar/MedicineDeliveryCar_Slave/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
//todo
#include <math.h>
#include <string.h>
#include <stdbool.h>
#include "pid.h"




//#define LINE_TARGET 0.0  
#define ONE_P_TIM2H 100   //10ms
#define ENCODER_INIT_CNT 0x0FFFFFFF
#define MIN_OUT 150       //PWM
#define MAX_OUT 900      //PWM


extern PID l_pid;
extern PID r_pid;
extern PID pid_line;
extern PID pid_distance_l;
extern PID pid_distance_r;

extern float speed_target;
extern float speed_line_offset;
extern int16_t deviation;




//todo
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Medicine_IN_Pin GPIO_PIN_3
#define Medicine_IN_GPIO_Port GPIOE
#define LED_GREEN_Pin GPIO_PIN_5
#define LED_GREEN_GPIO_Port GPIOE
#define LED_YELLOW_Pin GPIO_PIN_13
#define LED_YELLOW_GPIO_Port GPIOC
#define LED_RED_Pin GPIO_PIN_1
#define LED_RED_GPIO_Port GPIOC
#define ENCODER_Right_A_Pin GPIO_PIN_0
#define ENCODER_Right_A_GPIO_Port GPIOA
#define ENCODER_Right_B_Pin GPIO_PIN_1
#define ENCODER_Right_B_GPIO_Port GPIOA
#define Bluetooth_TX_Pin GPIO_PIN_2
#define Bluetooth_TX_GPIO_Port GPIOA
#define Bluetooth_RX_Pin GPIO_PIN_3
#define Bluetooth_RX_GPIO_Port GPIOA
#define ENCODER_Left_A_Pin GPIO_PIN_5
#define ENCODER_Left_A_GPIO_Port GPIOA
#define MOTOR_Left_positive_Pin GPIO_PIN_6
#define MOTOR_Left_positive_GPIO_Port GPIOA
#define MOTOR_Left_negative_Pin GPIO_PIN_7
#define MOTOR_Left_negative_GPIO_Port GPIOA
#define MOTOR_Right_positive_Pin GPIO_PIN_0
#define MOTOR_Right_positive_GPIO_Port GPIOB
#define MOTOR_Right_negative_Pin GPIO_PIN_1
#define MOTOR_Right_negative_GPIO_Port GPIOB
#define JY901S_TX_Pin GPIO_PIN_10
#define JY901S_TX_GPIO_Port GPIOB
#define JY901S_RX_Pin GPIO_PIN_11
#define JY901S_RX_GPIO_Port GPIOB
#define K210_TX_Pin GPIO_PIN_9
#define K210_TX_GPIO_Port GPIOA
#define K210_RX_Pin GPIO_PIN_10
#define K210_RX_GPIO_Port GPIOA
#define Screen_TX_Pin GPIO_PIN_10
#define Screen_TX_GPIO_Port GPIOC
#define Screen_RX_Pin GPIO_PIN_11
#define Screen_RX_GPIO_Port GPIOC
#define ENCODER_Left_B_Pin GPIO_PIN_3
#define ENCODER_Left_B_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
